Repository: ahmedalnagdy18/rigow
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Log in
ar: تسجيل دخول

source: Next
ar: التالي

source: Skip
ar: تخطى

source: Edit
ar: تعديل

source: Delete
ar: حذف

source: Cancel
ar: إلغاء

source: Back
ar: رجوع

source: Added successfully
ar: تمت الإضافة بنجاح

# continuee
source: Continue
ar: استمرار

source: Get Started
ar: ابدأ

source: Sign up
ar: إنشاء حساب

source: Email address
ar: عنوان البريد الالكتروني

source: Password
ar: كلمة المرور

# lang
source: العربيه
ar: English

source: Continue as an User
ar: استمر كمستخدم

source: Continue as an expert
ar: استمر كخبير

source: Explore the app
ar: استكشف التطبيق

# onboarding1
source: Share posts, join rooms to ask for experts' advice, and enjoy communicating with others
ar: شارك المنشورات، وانضم إلى الغرف لطلب مشورة الخبراء، واستمتع بالتواصل مع الآخرين

# onboarding2
source: Boost your wellness and fitness through expert reels, stories, and blogs
ar: قم بتحسين صحتك ولياقتك البدنية من خلال متابعة منشورات الخبراء وحالاتهم ومقالاتهم

# onboarding3
source: Learn something new and share your knowledge
ar: مع ريجو تعلم شيئًا جديدًا وشارك معرفتك

source: Welcome to Rigow
ar: مرحبا بك

# chooseTheWay
source: Choose the way you prefer to create your account
ar: اختر كيف تود انشاء حسابك

source: Sign up by Email
ar: تسجيل الدخول باستخدام البريد الالكتروني

source: Continue with Google
ar: تسجيل الدخول باستخدام جوجل

source: Continue with Facebook
ar: تسجيل الدخول باستخدام فيسبوك

source: Continue with Apple
ar: تسجيل الدخول باستخدام آبل

source: Explore as a guest
ar: استكشف التطبيق

source: Already have an account?
ar: هل لديك حساب بالفعل؟

# agreeToOur
source: By continuing, you agree to our
ar: من خلال المتابعة ،

source: Terms of services
ar: شروط الخدمة

source: and
ar: و

source: Privacy policy
ar: سياسة الخصوصية

source: Welcome back
ar: مرحبا بعودتك

# logToYourAccount
source: Log in to your account
ar: قم بتسجيل الدخول الى حسابك

source: Forget password?
ar: هل نسيت كلمه المرور؟

# dontHaveAcc
source: Don’t have an account?
ar: ليس لديك حساب ؟

source: Reset Password
ar: استعاده كلمه المرور

source: Reset your Password
ar: استعاده كلمه المرور

# resetExplian
source: We’ll confirm your account by sending a verification code to your email address.
ar: سنقوم بتأكيد حسابك عن طريق إرسال رمز التحقق إلى عنوان بريدك الإلكتروني، من فضلك ادخل عنوان بريدك الالكتروني

source: Send code
ar: أرسل رمز التحقق

source: Verify your
ar: تأكيد حسابك

# enterVerificationCodeSent
source: Enter the 4-digit verification code sent to your email
ar: أدخل رمز التحقق المكون من 4 أرقام المرسل إلى بريدك الإلكتروني

source: Change
ar: تغيير عنوان البريد

source: Resend code in
ar: إعادة الإرسال خلال

# didnotReceiveAnyCodeYet
source: Didn’t receive any code yet ?
ar: لم تستلم اي رمز بعد؟

source: Resend code
ar: إعادة الإرسال

source: Create your new password
ar: قم بإنشاء كلمة المرور الجديده

source: New password
ar: كلمة المرور الجديده

source: Re-type new password
ar: أعد كتابة كلمة المرور

# errorEmail
source: Please enter a valid email
ar: الرجاء إدخال بريد إلكتروني صحيح

# confirmPasswordExplian
source: We’ll confirm your account by sending a verification code to your email address.
ar: قم بإنشاء كلمة المرور الجديده

# weak
source: Weak, add numbers, letters and symbols
ar: ضعيف، يمكنك اضافة أرقام وحروف ورموز

source: Strong
ar: قوي

source: Matched
ar: متطابق

# equal
source: The two password should be equal
ar: يجب ان يكونوا متشابهين

source: Success!
ar: تم بنجاح

# yourPasswordSuccessfully
source: Your password has been reset successfully
ar: تم إعادة تعيين كلمة المرور الخاصة بك بنجاح

source: Complete Profile
ar: أكمل ملفك الشخصي

source: First name
ar: الاسم الأول

source: Last name
ar: الاسم الأخير

source: Mobile number
ar: أدخل رقم هاتفك

source: Complete your profile
ar: أكمل ملفك الشخصي

source: Complete your account
ar: أكمل البيانات أدناه لانشاء حسابك

source: Personal info
ar: المعلومات الشخصيه

source: Gender
ar: النوع

source: Male
ar: ذكر

source: Female
ar: أنثى

source: Birthdate
ar: تاريخ الميلاد

source: Tap to set
ar: اضغط للتحديد

source: Welcome,
ar: مرحبا

# welcomeDescreption
source: Account was successfully created. You can now connect Rigow Community and share your activities with them, come on to start your journey
ar: لقد تم انشاء حسابك بنجاح يمكنك الآن استكشاف مشاركات واستفسارات مجتمع ريجو ومشاركاتهم افكارك ونشاطاتك ، هيا ابدأ رحلتك

source: Sign up with Google
ar: تسجيل الدخول باستخدام جوجل

source: Sign up with Email
ar: انشاء حساب باستخدام البريد الالكتروني

source: Enter the required information
ar: أدخل البيانات ادناه لإنشاء حسابك

source: Region
ar: معلومات المنطقه والسكن

source: Country
ar: الدوله

source: City
ar: المدينة

source: Select your country
ar: قم بتحديد دولتك

source: Search country
ar: ابحث عن الدوله

source: Loading...
ar: تحميل...

# emailValidator
source: Please enter a valid email
ar: الرجاء إدخال بريد إلكتروني صالح

# exonboarding1
source: Share posts, join rooms, and communicate with others
ar: شارك المنشورات، وانضم إلى الغرف للحصول على المشوره ، واستمتع بالتواصل مع الآخرين

# exonboarding2
source: Create reels and stories, write blogs, and give answers to community queries as an administrator
ar: شارك نشاطاتك من خلال مقاطع الفيديو والحالات يوميه، اكتب مقالات وقدم إجابات لاستفسارات المجتمع كمسؤول للغرفه

source: Set your Expert account
ar: إعداد حساب خبير

source: Confirm your qualifications
ar: قم بإكمال البيانات ادناه لتأكيد مؤهلاتك

# expertWelcomeDescreption
source: You will continue as an expert, but you will have limited interactions until receiving a notification with account confirmation then you can manage all account features
ar: ستستمر كخبير، ولكن سيكون لديك تفاعلات محدودة حتى تتلقى بريد الكتروني بتأكيد الحساب، ثم يمكنك إدارة جميع ميزات الحساب , افحص بريدك الالكتروني بشكل دوري

source: Biography
ar: السيرة الذاتية

source: Tell about your self
ar: أخبرنا عن نفسك

source: University degree
ar: الدرجة الجامعية

source: Other certifications
ar: شهادات أخرى

source: Government permit
ar: تصريح حكومي

source: Nationality
ar: الجنسية

source: Full name in national ID
ar: الاسم الكامل في الهوية الوطنية

# typeYourFullNationalId
source: Type your full name in your national ID
ar: اكتب اسمك الكامل في هويتك الوطنية

source: National ID number
ar: رقم الهوية الوطنية

source: Type your national ID number
ar: اكتب رقم هويتك الوطنية

source: National ID (front)
ar: الهوية الوطنية (الواجهة)

source: National ID (back)
ar: الهوية الوطنية (الخلفية)

source: Experience
ar: الخبرة

source: Specialty
ar: التخصص

source: Faculty
ar: الكلية

source: Department
ar: القسم

source: Type your university name
ar: اكتب اسم جامعتك

source: Tap to upload
ar: اضغط للتحميل

source: Add Faculty name here
ar: أضف اسم الكلية هنا

source: Add Department
ar: أضف القسم

source: Select your Faculty department
ar: اختر قسم الكلية

source: Search Department
ar: ابحث عن القسم

# noDepartmentsFound
source: No departments found for selected faculty
ar: لم يتم العثور على أقسام للكلية المختارة

source: Select your specialty
ar: اختر تخصصك

source: Search specialty
ar: ابحث عن التخصص

source: Select your faculty
ar: اختر كليتك

source: Search Faculty
ar: ابحث عن الكلية

source: Add Faculty
ar: أضف الكلية

source: Social links
ar: روابط التواصل الاجتماعي

source: Add link
ar: أضف الرابط

source: Expert account Polices
ar: سياسات حساب الخبراء

# toHaveExpertUserRIGOW
source: To have an expert user account in the RIGOW, the following policies could be implemented:
ar: للحصول على حساب مستخدم خبير في RIGOW، يمكن تطبيق السياسات التالية:

# policesTitle1
source: Certification Requirement:
ar: متطلبات الشهادات:

# policesTitle2
source: Content Quality Standards:
ar: معايير جودة المحتوى:

# policesTitle3
source: Engagement Criteria:
ar: معايير التفاعل:

# policesTitle4
source: Community Contribution:
ar: المساهمة في المجتمع:

# policesTitle5
source: Continuous Education:
ar: التعليم المستمر:

# policesTitle6
source: Review Process:
ar: عملية المراجعة:

# policesTitle7
source: Code of Conduct:
ar: مدونة السلوك:

# policesHintText1
source: You must provide proof of certification or accreditation in a relevant fitness or wellness field to make sure that you have the necessary knowledge and expertise to contribute meaningfully to the community.
ar: يجب عليك تقديم دليل على الشهادة أو الاعتماد في مجال اللياقة البدنية أو الصحة ذات الصلة للتأكد من أن لديك المعرفة والخبرة اللازمة للمساهمة بشكل فعال في المجتمع.

# policesHintText2
source: you are required to maintain high-quality standards in your content, including accuracy, relevance, and professionalism. Regular audits or reviews of your posts may be conducted to ensure adherence to these standards.
ar: يتطلب منك الحفاظ على معايير عالية الجودة في محتواك، بما في ذلك الدقة، والملاءمة، والاحترافية. قد يتم إجراء تدقيقات أو مراجعات منتظمة على منشوراتك للتأكد من الالتزام بهذه المعايير.

# policesHintText3
source: you should demonstrate active engagement within the RIGOW community by regularly posting informative and valuable content, interacting with other users, and participating in discussions or challenges related to fitness and wellness.
ar: يجب عليك إظهار تفاعل نشط داخل مجتمع RIGOW من خلال نشر محتوى قيم ومفيد بانتظام، والتفاعل مع المستخدمين الآخرين، والمشاركة في المناقشات أو التحديات المتعلقة باللياقة البدنية والصحة.

# policesHintText4
source: Expert users encourage other users to contribute to the community by sharing insights, offering advice, and providing support to them. Their contributions should enrich the overall experience of the app and align with its mission of promoting health and well-being.
ar: يشجع الخبراء المستخدمين الآخرين على المساهمة في المجتمع من خلال مشاركة الأفكار، وتقديم النصائح، وتقديم الدعم لهم. يجب أن تثري مساهماتهم التجربة العامة للتطبيق وتتماشى مع مهمته في تعزيز الصحة والرفاهية.

# policesHintText5
source: Expert users are expected to stay updated with the latest trends, research, and developments in the fitness and wellness industry. Participation in continuing education programs or workshops may be encouraged to ensure your knowledge remains current and relevant.
ar: يتوقع من الخبراء البقاء على اطلاع بأحدث الاتجاهات والأبحاث والتطورات في صناعة اللياقة البدنية والصحة. قد يتم تشجيعهم على المشاركة في برامج التعليم المستمر أو ورش العمل لضمان بقاء معرفتهم محدثة وذات صلة.

# policesHintText6
source: The upgrade to an expert user account may involve a review process conducted by the app administrators or a designated panel. This review assesses the user's qualifications, experience, and contributions to determine eligibility for the expert status.
ar: قد تتضمن الترقية إلى حساب خبير عملية مراجعة يتم إجراؤها من قبل مسؤولي التطبيق أو لجنة معينة. تقيّم هذه المراجعة مؤهلات المستخدم وخبراته ومساهماته لتحديد أهليته للحصول على حالة الخبير.

# policesHintText7
source: Expert users must adhere to a strict code of conduct, which prohibits the dissemination of false information, engagement in harmful practices, or any behavior that undermines the integrity of the RIGOW community.
ar: يجب على الخبراء الالتزام بمدونة سلوك صارمة تمنع نشر المعلومات الخاطئة أو الانخراط في ممارسات ضارة أو أي سلوك يقوض نزاهة مجتمع RIGOW.

# policesEndText
source: By implementing these policies, RIGOW can ensure that its expert user accounts uphold the highest standards of professionalism, expertise, and contribution to foster a vibrant and supportive community focused on fitness and wellness.
ar: من خلال تطبيق هذه السياسات، يمكن لـ RIGOW ضمان أن حسابات المستخدمين الخبراء تحافظ على أعلى معايير الاحترافية والخبرة والمساهمة، لتعزيز مجتمع نشط وداعم يركز على اللياقة البدنية والصحة.

source: Send the request
ar: أرسل الطلب

# yourRequestSuccessfully
source: Your Request have been sent successfully
ar: تم إرسال طلبك بنجاح
